In [1]:
import pandas as pd

In [2]:
data = [['Juan',20],['Pedro',23]]

df = pd.DataFrame(data, columns = ['nombre', 'edad'])
df

  nombre  edad
0   Juan    20
1  Pedro    23

In [3]:
data = {
    'nombre':[20, 23],
    'edad': ['Juan', 'Pedro']
}

df2 = pd.DataFrame(data)
df2

   nombre   edad
0      20   Juan
1      23  Pedro

In [7]:
df = pd.read_csv("../data/data/data.csv")
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [9]:
df = pd.read_csv("../data/data/data", sep= '|')
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [12]:
df = pd.read_csv("../data/data/data_without_header", header=None, names=['nombre','edad','ciudad'])
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [13]:
df = pd.read_json("../data/data/data.json")
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [14]:
df.head(1)

  nombre  edad  ciudad
0   Juan    25  Madrid

In [16]:
df.columns
df.columns[1:2]

Index(['edad'], dtype='object')

In [17]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [18]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [19]:
df.tail(1)

  nombre  edad   ciudad
2  Pedro    35  Sevilla